// Словарь с флагами стран для каждой валюты

export const currencyFlags: Record<string, string> = {
    EUR: '🇪🇺', // Флаг Евросоюза
    RUB: '🇷🇺', // Флаг России
    USD: '🇺🇸', // Флаг США
    GBP: '🇬🇧', // Флаг Великобритании
    CNY: '🇨🇳', // Флаг Китая
    MXN: '🇲🇽', // Флаг Мексики
    ISK: '🇮🇸', // Флаг Исландии
    KRW: '🇰🇷', // Флаг Южной Кореи
    HKD: '🇭🇰', // Флаг Гонконга
    CZK: '🇨🇿', // Флаг Чехии
    BGN: '🇧🇬', // Флаг Болгарии
    BRL: '🇧🇷', // Флаг Бразилии
    IDR: '🇮🇩', // Флаг Индонезии
    SGD: '🇸🇬', // Флаг Сингапура
    PHP: '🇵🇭', // Флаг Филиппин
    RON: '🇷🇴', // Флаг Румынии
    HUF: '🇭🇺', // Флаг Венгрии
    ILS: '🇮🇱', // Флаг Израиля
    THB: '🇹🇭', // Флаг Таиланда
    SEK: '🇸🇪', // Флаг Швеции
    NZD: '🇳🇿', // Флаг Новой Зеландии
    AUD: '🇦🇺', // Флаг Австралии
    DKK: '🇩🇰', // Флаг Дании
    HRK: '🇭🇷', // Флаг Хорватии
    PLN: '🇵🇱', // Флаг Польши
    TRY: '🇹🇷', // Флаг Турции
    INR: '🇮🇳', // Флаг Индии
    MYR: '🇲🇾', // Флаг Малайзии
    ZAR: '🇿🇦', // Флаг Южноафриканской Республики
    JPY: '🇯🇵'  // Флаг Японии
};
